org-files/teaching.org
#+OPTIONS: toc:t
#+Title: Jan's teaching projects


The courses that I teach can be found on github. 

* Courses that I am currently teaching:

+ [[https://janboone.github.io/applied-economics/index.html][Applied Economics]] is an MSc course in economics preparing students to write their MSc thesis. The part that I teach uses Python to teach students how to solve models, do simulations, plot results etc. and write about these in a way that is understandable to people who do not know python nor a lot of economics.
+ [[https://janboone.github.io/msc_datascience/][Seminar Datascience for Economics]] is an MSc course in economics that gives students an introduction to statistical simulation and datascience.


* Material of courses that I have taught in the past:

+ [[https://janboone.github.io/programming_for_economists/index.html][Programming for Economists]] is a first year BSc course where we give economic students an introduction to the programming languages Python and R. It is not a traditional introduction to programming with an emphasis on programming concepts and programming examples (like sorting routines). Instead we show students from the start how to use these programming languages in economics with applications like solving equations, maximizing functions, calculating equilibria (fixed points), handling data, plotting data etc.
+ [[http://janboone.github.io/competition_policy_and_regulation][Competition Policy and Regulation]] is a third year BSc course on competition policy. We go over topics like market definition, predation, foreclosure, regulation (especially in health care markets). The material is illustrated using Python simulations.
+ [[https://janboone.github.io/RM/][Advanced Industrial Organization]] is a graduate course in contract theory focusing on contractual externalities and bilateral contracting.

