pages/teaching/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-23 ma 11:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jan's teaching projects</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jan Boone" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">

  <p style="text-align: center;">
    
  <a id="name" href="https://janboone.github.io/homepage/pages/">Jan Boone</a> <br>

  </p>
  
<p style="text-align: justify;">

  <a id="subtitle" href="https://janboone.github.io/homepage/pages/cv/">CV</a>
  <a id="subtitle" href="https://janboone.github.io/homepage/pages/research/">Research</a>
  <a id="subtitle" href="https://janboone.github.io/homepage/pages/teaching/">Teaching</a>
  <a id="subtitle" href="https://janboone.github.io/homepage/">Blog</a>

  <span> </span>
</div>

</p>

</div>
</div>
</div>
<div id="content">
<h1 class="title">Jan's teaching projects</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7d812c6">Courses that I am currently teaching:</a></li>
<li><a href="#org9ffd02b">Material of courses that I have taught in the past:</a></li>
</ul>
</div>
</div>
<p>
The courses that I teach can be found on github. 
</p>

<div id="outline-container-org7d812c6" class="outline-2">
<h2 id="org7d812c6">Courses that I am currently teaching:</h2>
<div class="outline-text-2" id="text-org7d812c6">
<ul class="org-ul">
<li><a href="https://janboone.github.io/applied-economics/">Applied Economics</a> is an MSc course in economics preparing students to write their MSc thesis. The part that I teach uses Python to teach students how to solve models, do simulations, plot results etc. and write about these in a way that is understandable to people who do not know python nor a lot of economics.</li>
<li><a href="https://janboone.github.io/msc_datascience/">Seminar Datascience for Economics</a> is an MSc course in economics that gives students an introduction to statistical simulation and datascience.</li>
</ul>
</div>
</div>


<div id="outline-container-org9ffd02b" class="outline-2">
<h2 id="org9ffd02b">Material of courses that I have taught in the past:</h2>
<div class="outline-text-2" id="text-org9ffd02b">
<ul class="org-ul">
<li><a href="https://janboone.github.io/programming_for_economists/">Programming for Economists</a> is a first year BSc course where we give economic students an introduction to the programming languages Python and R. It is not a traditional introduction to programming with an emphasis on programming concepts and programming examples (like sorting routines). Instead we show students from the start how to use these programming languages in economics with applications like solving equations, maximizing functions, calculating equilibria (fixed points), handling data, plotting data etc.</li>
<li><a href="http://janboone.github.io/competition_policy_and_regulation">Competition Policy and Regulation</a> is a third year BSc course on competition policy. We go over topics like market definition, predation, foreclosure, regulation (especially in health care markets). The material is illustrated using Python simulations.</li>
<li><a href="https://janboone.github.io/RM/">Advanced Industrial Organization</a> is a graduate course in contract theory focusing on contractual externalities and bilateral contracting.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="postamble" class="status">

<footer id="footer" class="color color-secondary short">
<p style="text-align: justify;">

  <a id="subtitle" href="https://janboone.github.io/homepage/pages/cv/">CV</a>
  <a id="subtitle" href="https://janboone.github.io/homepage/pages/research/">Research</a>
  <a id="subtitle" href="https://janboone.github.io/homepage/pages/teaching/">Teaching</a>
  <a id="subtitle" href="https://janboone.github.io/homepage/">Blog</a>
  <span> </span>
</div>
</p>

</footer>
</div>
</div>
</body>
</html>
